Revit 2024 API
StairsRunType.TreadNosingPosition Property
 Represents on which edges of the nosing to apply the nosing profile.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public TreadNosingPosition TreadNosingPosition { get; set; }
Visual Basic
Public Property TreadNosingPosition As TreadNosingPosition
	Get
	Set
Visual C++
public:
property TreadNosingPosition TreadNosingPosition {
	TreadNosingPosition get ();
	void set (TreadNosingPosition value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  When setting this property: The run type has no tread so the data being set is not applicable.
See Also
StairsRunType Class
Autodesk.Revit.DB.Architecture Namespace